#### Terraform Plan 📋
```
Acquiring state lock. This may take a few moments...
data.alz_architecture.this: Reading...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1kYmY2ZjRiMy1hOWY2LTRjMmEtODE2Yi0wYmExZTAxMWNlOGI7b2JqZWN0SWQ9ZGQyYjY1ZWQtMmUyMi00MDhjLWE5NTUtNjFlZjRhOWUzZDhmO3N1YnNjcmlwdGlvbklkPWJlYzgwYTFiLTdmMDQtNDYyZC05Mjk5LTE0OTEzOGVlMGU4YTt0ZW5hbnRJZD04OTE3ZWQzNS1mZjNlLTQ0YWMtYjcyZS1mZGJkM2VkM2E3ZmY=]
data.alz_architecture.this: Still reading... [00m10s elapsed]
data.alz_architecture.this: Still reading... [00m20s elapsed]
data.alz_architecture.this: Still reading... [00m30s elapsed]
data.alz_architecture.this: Still reading... [00m40s elapsed]
data.alz_architecture.this: Read complete after 44s [id=alz_with_amba]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azapi_resource.alz_policy_assignments["alz-connectivity/Deploy-AMBA-Connectivity"] will be created
  + resource "azapi_resource" "alz_policy_assignments" {
      + body                             = {
          + properties = {
              + description           = "This initiative deploys Azure Monitor Baseline Alerts (AMBA-ALZ) to monitor Network components such as Azure Firewalls, ExpressRoute, VPN, and Private DNS Zones."
              + displayName           = "Deploy Azure Monitor Baseline Alerts (AMBA-ALZ) for Connectivity - Part #1"
              + enforcementMode       = "Default"
              + metadata              = {
                  + _deployed_by_amba = true
                  + createdBy         = ""
                  + createdOn         = ""
                  + updatedBy         = ""
                  + updatedOn         = ""
                }
              + nonComplianceMessages = [
                  + {
                      + message = "Alerting {enforcementMode} be deployed to Azure services."
                    },
                ]
              + notScopes             = []
              + overrides             = []
              + parameters            = {
                  + AFWSNATPortUtilizationPolicyEffect                = {
                      + value = "deployIfNotExists"
                    }
                  + ALZMonitorDisableTagName                          = {
                      + value = "MonitorDisable"
                    }
                  + ALZMonitorDisableTagValues                        = {
                      + value = [
                          + "true",
                          + "Test",
                          + "Dev",
                          + "Sandbox",
                        ]
                    }
                  + ALZMonitorResourceGroupLocation                   = {
                      + value = "japaneast"
                    }
                  + ALZMonitorResourceGroupName                       = {
                      + value = "rg-amba-alerts-japaneast"
                    }
                  + ALZMonitorResourceGroupTags                       = {
                      + value = {
                          + deployed_by = "terraform"
                          + environment = "production"
                          + managed_by  = "platform-team"
                        }
                    }
                  + ERCIRArpAvailabilityPolicyEffect                  = {
                      + value = "deployIfNotExists"
                    }
                  + ERCIRBgpAvailabilityPolicyEffect                  = {
                      + value = "deployIfNotExists"
                    }
                  + ERCIRQoSDropBitsinPerSecPolicyEffect              = {
                      + value = "deployIfNotExists"
                    }
                  + ERCIRQoSDropBitsoutPerSecPolicyEffect             = {
                      + value = "deployIfNotExists"
                    }
                  + ERGwExpressRouteBitsInPolicyEffect                = {
                      + value = "disabled"
                    }
                  + ERGwExpressRouteBitsOutPolicyEffect               = {
                      + value = "disabled"
                    }
                  + ERGwExpressRouteCpuUtilPolicyEffect               = {
                      + value = "deployIfNotExists"
                    }
                  + ERPBitsInPerSecondPolicyEffect                    = {
                      + value = "deployIfNotExists"
                    }
                  + ERPBitsOutPerSecondPolicyEffect                   = {
                      + value = "deployIfNotExists"
                    }
                  + ERPLineProtocolPolicyEffect                       = {
                      + value = "deployIfNotExists"
                    }
                  + ERPRxLightLevelHighPolicyEffect                   = {
                      + value = "deployIfNotExists"
                    }
                  + ERPRxLightLevelLowPolicyEffect                    = {
                      + value = "deployIfNotExists"
                    }
                  + ERPTxLightLevelHighPolicyEffect                   = {
                      + value = "deployIfNotExists"
                    }
                  + ERPTxLightLevelLowPolicyEffect                    = {
                      + value = "deployIfNotExists"
                    }
                  + FirewallHealthPolicyEffect                        = {
                      + value = "deployIfNotExists"
                    }
                  + LBDatapathAvailabilityPolicyEffect                = {
                      + value = "deployIfNotExists"
                    }
                  + LBGlobalBackendAvailabilityPolicyEffect           = {
                      + value = "deployIfNotExists"
                    }
                  + LBHealthProbeStatusPolicyEffect                   = {
                      + value = "deployIfNotExists"
                    }
                  + LBUsedSNATPortsPolicyEffect                       = {
                      + value = "deployIfNotExists"
                    }
                  + PDNSZCapacityUtilPolicyEffect                     = {
                      + value = "deployIfNotExists"
                    }
                  + PDNSZQueryVolumePolicyEffect                      = {
                      + value = "disabled"
                    }
                  + PDNSZRecordSetCapacityPolicyEffect                = {
                      + value = "deployIfNotExists"
                    }
                  + PDNSZRegistrationCapacityUtilPolicyEffect         = {
                      + value = "deployIfNotExists"
                    }
                  + PIPBytesInDDoSPolicyEffect                        = {
                      + value = "disabled"
                    }
                  + PIPDDoSAttackPolicyEffect                         = {
                      + value = "deployIfNotExists"
                    }
                  + PIPPacketsInDDoSPolicyEffect                      = {
                      + value = "disabled"
                    }
                  + PIPVIPAvailabilityPolicyEffect                    = {
                      + value = "deployIfNotExists"
                    }
                  + VNETDDOSAttackPolicyEffect                        = {
                      + value = "deployIfNotExists"
                    }
                  + VPNGWBandWidthUtilPolicyEffect                    = {
                      + value = "deployIfNotExists"
                    }
                  + VPNGWEgressPolicyEffect                           = {
                      + value = "disabled"
                    }
                  + VPNGWIngressPolicyEffect                          = {
                      + value = "disabled"
                    }
                  + VPNGWTunnelEgressPacketDropCountPolicyEffect      = {
                      + value = "deployIfNotExists"
                    }
                  + VPNGWTunnelEgressPacketDropMismatchPolicyEffect   = {
                      + value = "deployIfNotExists"
                    }
                  + VPNGWTunnelIngressPacketDropCountPolicyEffect     = {
                      + value = "deployIfNotExists"
                    }
                  + VPNGWTunnelIngressPacketDropMismatchPolicyEffect  = {
                      + value = "deployIfNotExists"
                    }
                  + VPNGwBGPPeerStatusPolicyEffect                    = {
                      + value = "deployIfNotExists"
                    }
                  + VnetGwERCpuUtilPolicyEffect                       = {
                      + value = "deployIfNotExists"
                    }
                  + VnetGwExpressRouteBitsPerSecondPolicyEffect       = {
                      + value = "deployIfNotExists"
                    }
                  + VnetGwTunnelBWPolicyEffect                        = {
                      + value = "deployIfNotExists"
                    }
                  + VnetGwTunnelEgressPacketDropCountPolicyEffect     = {
                      + value = "deployIfNotExists"
                    }
                  + VnetGwTunnelEgressPacketDropMismatchPolicyEffect  = {
                      + value = "deployIfNotExists"
                    }
                  + VnetGwTunnelEgressPolicyEffect                    = {
                      + value = "disabled"
                    }
                  + VnetGwTunnelIngressPacketDropCountPolicyEffect    = {
                      + value = "deployIfNotExists"
                    }
                  + VnetGwTunnelIngressPacketDropMismatchPolicyEffect = {
                      + value = "deployIfNotExists"
                    }
                  + VnetGwTunnelIngressPolicyEffect                   = {
                      + value = "disabled"
                    }
                  + activityFWDeletePolicyEffect                      = {
                      + value = "deployIfNotExists"
                    }
                  + activityNSGDeletePolicyEffect                     = {
                      + value = "deployIfNotExists"
                    }
                  + activityUDRDeletePolicyEffect                     = {
                      + value = "deployIfNotExists"
                    }
                  + activityUDRRoutesDeletePolicyEffect               = {
                      + value = "deployIfNotExists"
                    }
                  + activityUDRUpdatePolicyEffect                     = {
                      + value = "deployIfNotExists"
                    }
                  + activityVPNGWDeletePolicyEffect                   = {
                      + value = "deployIfNotExists"
                    }
                }
              + policyDefinitionId    = "/providers/Microsoft.Management/managementGroups/alz/providers/Microsoft.Authorization/policySetDefinitions/Alerting-Connectivity"
              + resourceSelectors     = []
            }
        }
      + id                               = (known after apply)
      + ignore_casing                    = false
      + ignore_missing_property          = true
      + ignore_null_property             = false
      + location                         = "japaneast"
      + name                             = "Deploy-AMBA-Connectivity"
      + output                           = (known after apply)
      + parent_id                        = "/providers/Microsoft.Management/managementGroups/alz-connectivity"
      + replace_triggers_external_values = [
          + "/providers/Microsoft.Management/managementGroups/alz/providers/Microsoft.Authorization/policySetDefinitions/Alerting-Connectivity",
          + "japaneast",
        ]
      + response_export_values           = []
      + retry                            = {
          + error_message_regex  = [
              + "out of scope",
              + "hierarchy",
              + "not found",
              + "NotFound",
              + "AuthorizationFailed",
            ]
          + interval_seconds     = 30
          + max_interval_seconds = 300
          + multiplier           = 1.5
          + randomization_factor = 0.5
        }
      + schema_validation_enabled        = true
      + sensitive_body                   = (write-only attribute)
      + type                             = "Microsoft.Authorization/policyAssignments@2024-04-01"

      + identity {
          + identity_ids = []
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # azapi_resource.alz_policy_assignments["alz-connectivity/Deploy-AMBAConnectivity2"] will be created
  + resource "azapi_resource" "alz_policy_assignments" {
      + body                             = {
          + properties = {
              + description           = "This initiative deploys Azure Monitor Baseline Alerts (AMBA-ALZ) to monitor Network components such as Azure Firewalls, ExpressRoute, VPN, and Private DNS Zones."
              + displayName           = "Deploy Azure Monitor Baseline Alerts (AMBA-ALZ) for Connectivity - Part #2"
              + enforcementMode       = "Default"
              + metadata              = {
                  + _deployed_by_amba = true
                  + createdBy         = ""
                  + createdOn         = ""
                  + updatedBy         = ""
                  + updatedOn         = ""
                }
              + nonComplianceMessages = [
                  + {
                      + message = "Alerting {enforcementMode} be deployed to Azure services."
                    },
                ]
              + notScopes             = []
              + overrides             = []
              + parameters            = {
                  + AFWApplicationRuleHitPolicyEffect                    = {
                      + value = "deployIfNotExists"
                    }
                  + AFWNetworkRuleHitPolicyEffect                        = {
                      + value = "deployIfNotExists"
                    }
                  + ALZMonitorDisableTagName                             = {
                      + value = "MonitorDisable"
                    }
                  + ALZMonitorDisableTagValues                           = {
                      + value = [
                          + "true",
                          + "Test",
                          + "Dev",
                          + "Sandbox",
                        ]
                    }
                  + ERGwExpressRouteGatewayActiveFlowsPolicyEffect       = {
                      + value = "disabled"
                    }
                  + P2SVPNGatewaysP2SBandwidthPolicyEffect               = {
                      + value = "deployIfNotExists"
                    }
                  + P2SVPNGatewaysP2SConnectionCountPolicyEffect         = {
                      + value = "deployIfNotExists"
                    }
                  + P2SVPNGatewaysUserVpnRouteCountPolicyEffect          = {
                      + value = "deployIfNotExists"
                    }
                  + VirtualHubsBgpPeerStatusPolicyEffect                 = {
                      + value = "deployIfNotExists"
                    }
                  + VirtualHubsCountOfRoutesAdvertisedToPeerPolicyEffect = {
                      + value = "deployIfNotExists"
                    }
                  + VirtualHubsCountOfRoutesLearnedFromPeerPolicyEffect  = {
                      + value = "deployIfNotExists"
                    }
                  + VirtualHubsRoutingInfrastructureUnitsPolicyEffect    = {
                      + value = "deployIfNotExists"
                    }
                  + VirtualHubsSpokeVMUtilizationPolicyEffect            = {
                      + value = "deployIfNotExists"
                    }
                  + VirtualHubsVirtualHubDataProcessedPolicyEffect       = {
                      + value = "deployIfNotExists"
                    }
                }
              + policyDefinitionId    = "/providers/Microsoft.Management/managementGroups/alz/providers/Microsoft.Authorization/policySetDefinitions/Alerting-Connectivity-2"
              + resourceSelectors     = []
            }
        }
      + id                               = (known after apply)
      + ignore_casing                    = false
      + ignore_missing_property          = true
      + ignore_null_property             = false
      + location                         = "japaneast"
      + name                             = "Deploy-AMBAConnectivity2"
      + output                           = (known after apply)
      + parent_id                        = "/providers/Microsoft.Management/managementGroups/alz-connectivity"
      + replace_triggers_external_values = [
          + "/providers/Microsoft.Management/managementGroups/alz/providers/Microsoft.Authorization/policySetDefinitions/Alerting-Connectivity-2",
          + "japaneast",
        ]
      + response_export_values           = []
      + retry                            = {
          + error_message_regex  = [
              + "out of scope",
              + "hierarchy",
              + "not found",
              + "NotFound",
              + "AuthorizationFailed",
            ]
          + interval_seconds     = 30
          + max_interval_seconds = 300
          + multiplier           = 1.5
          + randomization_factor = 0.5
        }
      + schema_validation_enabled        = true
      + sensitive_body                   = (write-only attribute)
      + type                             = "Microsoft.Authorization/policyAssignments@2024-04-01"

      + identity {
          + identity_ids = []
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # azapi_resource.alz_policy_assignments["alz-corp/Audit-PeDnsZones"] will be created
  + resource "azapi_resource" "alz_policy_assignments" {
      + body                             = {
          + properties = {
              + description           = "Audits the deployment of Private Link Private DNS Zone resources in the Corp landing zone."
              + displayName           = "Audit Private Link Private DNS Zone resources"
              + enforcementMode       = "Default"
              + metadata              = {
                  + createdBy = ""
                  + createdOn = ""
                  + updatedBy = ""
                  + updatedOn = ""
                }
              + nonComplianceMessages = [
                  + {
                      + message = "Private Link Private DNS Zone resources {enforcementMode} be deployed in the Corp landing zone."
                    },
                ]
              + notScopes             = []
              + overrides             = []
              + parameters            = {
                  + effect              = {
                      + value = "Audit"
                    }
                  + privateLinkDnsZones = {
                      + value = [
                          + "privatelink.adf.azure.com",
                          + "privatelink.afs.azure.net",
                          + "privatelink.agentsvc.azure-automation.net",
                          + "privatelink.analysis.windows.net",
                          + "privatelink.api.azureml.ms",
                          + "privatelink.azconfig.io",
                          + "privatelink.azure-api.net",
                          + "privatelink.azure-automation.net",
                          + "privatelink.azurecr.io",
                          + "privatelink.azure-devices.net",
                          + "privatelink.azure-devices-provisioning.net",
                          + "privatelink.azuredatabricks.net",
                          + "privatelink.azurehdinsight.net",
                          + "privatelink.azurehealthcareapis.com",
                          + "privatelink.azurestaticapps.net",
                          + "privatelink.azuresynapse.net",
                          + "privatelink.azurewebsites.net",
                          + "privatelink.batch.azure.com",
                          + "privatelink.blob.core.windows.net",
                          + "privatelink.cassandra.cosmos.azure.com",
                          + "privatelink.cognitiveservices.azure.com",
                          + "privatelink.database.windows.net",
                          + "privatelink.datafactory.azure.net",
                          + "privatelink.dev.azuresynapse.net",
                          + "privatelink.dfs.core.windows.net",
                          + "privatelink.dicom.azurehealthcareapis.com",
                          + "privatelink.digitaltwins.azure.net",
                          + "privatelink.directline.botframework.com",
                          + "privatelink.documents.azure.com",
                          + "privatelink.eventgrid.azure.net",
                          + "privatelink.file.core.windows.net",
                          + "privatelink.gremlin.cosmos.azure.com",
                          + "privatelink.guestconfiguration.azure.com",
                          + "privatelink.his.arc.azure.com",
                          + "privatelink.kubernetesconfiguration.azure.com",
                          + "privatelink.managedhsm.azure.net",
                          + "privatelink.mariadb.database.azure.com",
                          + "privatelink.media.azure.net",
                          + "privatelink.mongo.cosmos.azure.com",
                          + "privatelink.monitor.azure.com",
                          + "privatelink.mysql.database.azure.com",
                          + "privatelink.notebooks.azure.net",
                          + "privatelink.ods.opinsights.azure.com",
                          + "privatelink.oms.opinsights.azure.com",
                          + "privatelink.pbidedicated.windows.net",
                          + "privatelink.postgres.database.azure.com",
                          + "privatelink.prod.migration.windowsazure.com",
                          + "privatelink.purview.azure.com",
                          + "privatelink.purviewstudio.azure.com",
                          + "privatelink.queue.core.windows.net",
                          + "privatelink.redis.cache.windows.net",
                          + "privatelink.redisenterprise.cache.azure.net",
                          + "privatelink.search.windows.net",
                          + "privatelink.service.signalr.net",
                          + "privatelink.servicebus.windows.net",
                          + "privatelink.siterecovery.windowsazure.com",
                          + "privatelink.sql.azuresynapse.net",
                          + "privatelink.table.core.windows.net",
                          + "privatelink.table.cosmos.azure.com",
                          + "privatelink.tip1.powerquery.microsoft.com",
                          + "privatelink.token.botframework.com",
                          + "privatelink.vaultcore.azure.net",
                          + "privatelink.web.core.windows.net",
                          + "privatelink.webpubsub.azure.com",
                        ]
                    }
                }
              + policyDefinitionId    = "/providers/Microsoft.Management/managementGroups/alz/providers/Microsoft.Authorization/policyDefinitions/Audit-PrivateLinkDnsZones"
              + resourceSelectors     = []
            }
        }
      + id                               = (known after apply)
      + ignore_casing                    = false
      + ignore_missing_property          = true
      + ignore_null_property             = false
      + location                         = "japaneast"
      + name                             = "Audit-PeDnsZones"
      + output                           = (known after apply)
      + parent_id                        = "/providers/Microsoft.Management/managementGroups/alz-corp"
      + replace_triggers_external_values = [
          + "/providers/Microsoft.Management/managementGroups/alz/providers/Microsoft.Authorization/policyDefinitions/Audit-PrivateLinkDnsZones",
          + "japaneast",
        ]
      + response_export_values           = []
      + retry                            = {
          + error_message_regex  = [
              + "out of scope",
              + "hierarchy",
              + "not found",
              + "NotFound",
              + "AuthorizationFailed",
            ]
          + interval_seconds     = 30
          + max_interval_seconds = 300
          + multiplier           = 1.5
          + randomization_factor = 0.5
        }
      + schema_validation_enabled        = true
      + sensitive_body                   = (write-only attribute)
      + type                             = "Microsoft.Authorization/policyAssignments@2024-04-01"

      + identity {
          + identity_ids = []
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "None"
        }
    }

  # azapi_resource.alz_policy_assignments["alz-corp/Deny-HybridNetworking"] will be created
  + resource "azapi_resource" "alz_policy_assignments" {
      + body                             = {
          + properties = {
              + description           = "Denies deployment of vWAN/ER/VPN gateway resources in the Corp landing zone."
              + displayName           = "Deny the deployment of vWAN/ER/VPN gateway resources"
              + enforcementMode       = "Default"
              + metadata              = {
                  + createdBy = ""
                  + createdOn = ""
                  + updatedBy = ""
                  + updatedOn = ""
                }
              + nonComplianceMessages = [
                  + {
                      + message = "vWAN/ER/VPN gateway resources {enforcementMode} not be deployed in the Corp landing zone."
                    },
                ]
              + notScopes             = []
              + overrides             = []
              + parameters            = {
                  + effect                        = {
                      + value = "Deny"
                    }
                  + listOfResourceTypesNotAllowed = {
                      + value = [
                          + "microsoft.network/expressroutecircuits",
                          + "microsoft.network/expressroutegateways",
                          + "microsoft.network/expressrouteports",
                          + "microsoft.network/virtualwans",
                          + "microsoft.network/virtualhubs",
                          + "microsoft.network/vpngateways",
                          + "microsoft.network/p2svpngateways",
                          + "microsoft.network/vpnsites",
                          + "microsoft.network/virtualnetworkgateways",
                        ]
                    }
                }
              + policyDefinitionId    = "/providers/Microsoft.Authorization/policyDefinitions/6c112d4e-5bc7-47ae-a041-ea2d9dccd749"
              + resourceSelectors     = []
            }
        }
      + id                               = (known after apply)
      + ignore_casing                    = false
      + ignore_missing_property          = true
      + ignore_null_property             = false
      + location                         = "japaneast"
      + name                             = "Deny-HybridNetworking"
      + output                           = (known after apply)
      + parent_id                        = "/providers/Microsoft.Management/managementGroups/alz-corp"
      + replace_triggers_external_values = [
          + "/providers/Microsoft.Authorization/policyDefinitions/6c112d4e-5bc7-47ae-a041-ea2d9dccd749",
          + "japaneast",
        ]
      + response_export_values           = []
      + retry                            = {
          + error_message_regex  = [
              + "out of scope",
              + "hierarchy",
              + "not found",
              + "NotFound",
              + "AuthorizationFailed",
            ]
          + interval_seconds     = 30
          + max_interval_seconds = 300
          + multiplier           = 1.5
          + randomization_factor = 0.5
        }
      + schema_validation_enabled        = true
      + sensitive_body                   = (write-only attribute)
      + type                             = "Microsoft.Authorization/policyAssignments@2024-04-01"

      + identity {
          + identity_ids = []
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "None"
        }
    }

  # azapi_resource.alz_policy_assignments["alz-corp/Deny-Public-Endpoints"] will be created
  + resource "azapi_resource" "alz_policy_assignments" {
      + body                             = {
          + properties = {
              + description           = "This policy initiative is a group of policies that prevents creation of Azure PaaS services with exposed public endpoints"
              + displayName           = "Public network access should be disabled for PaaS services"
              + enforcementMode       = "Default"
              + metadata              = {
                  + createdBy = ""
                  + createdOn = ""
                  + updatedBy = ""
                  + updatedOn = ""
                }
              + nonComplianceMessages = [
                  + {
                      + message = "Public network access {enforcementMode} be disabled for PaaS services."
                    },
                ]
     

... (truncated) ...

 ]
      + subnets                       = (known after apply)
      + tags                          = {
          + "deployed_by" = "terraform"
          + "environment" = "production"
          + "managed_by"  = "platform-team"
        }
    }

  # azurerm_route_table.spoke_to_firewall["secondary"] will be created
  + resource "azurerm_route_table" "spoke_to_firewall" {
      + bgp_route_propagation_enabled = false
      + id                            = (known after apply)
      + location                      = "japanwest"
      + name                          = "rt-spoke-to-fw-japanwest"
      + resource_group_name           = "rg-hub-japanwest"
      + route                         = [
          + {
              + address_prefix         = "0.0.0.0/0"
              + name                   = "default-to-firewall"
              + next_hop_in_ip_address = (known after apply)
              + next_hop_type          = "VirtualAppliance"
            },
        ]
      + subnets                       = (known after apply)
      + tags                          = {
          + "deployed_by" = "terraform"
          + "environment" = "production"
          + "managed_by"  = "platform-team"
        }
    }

  # azurerm_storage_account.law_archive[0] will be created
  + resource "azurerm_storage_account" "law_archive" {
      + access_tier                        = "Hot"
      + account_kind                       = "StorageV2"
      + account_replication_type           = "GRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "japaneast"
      + min_tls_version                    = "TLS1_2"
      + name                               = "stlawarchivejapaneast"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = false
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "rg-management-japaneast"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "deployed_by" = "terraform"
          + "environment" = "production"
          + "managed_by"  = "platform-team"
        }

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = true

          + container_delete_retention_policy {
              + days = 30
            }

          + delete_retention_policy {
              + days                     = 30
              + permanent_delete_enabled = false
            }
        }

      + immutability_policy {
          + allow_protected_append_writes = true
          + period_since_creation_in_days = 2555
          + state                         = "Unlocked"
        }

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # azurerm_storage_container.law_archive[0] will be created
  + resource "azurerm_storage_container" "law_archive" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "am-law-archive"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = (known after apply)
    }

  # azurerm_storage_management_policy.law_archive[0] will be created
  + resource "azurerm_storage_management_policy" "law_archive" {
      + id                 = (known after apply)
      + storage_account_id = (known after apply)

      + rule {
          + enabled = true
          + name    = "archive-immediately"

          + actions {
              + base_blob {
                  + delete_after_days_since_creation_greater_than                  = -1
                  + delete_after_days_since_last_access_time_greater_than          = -1
                  + delete_after_days_since_modification_greater_than              = -1
                  + tier_to_archive_after_days_since_creation_greater_than         = 0
                  + tier_to_archive_after_days_since_last_access_time_greater_than = -1
                  + tier_to_archive_after_days_since_last_tier_change_greater_than = -1
                  + tier_to_archive_after_days_since_modification_greater_than     = -1
                  + tier_to_cold_after_days_since_creation_greater_than            = -1
                  + tier_to_cold_after_days_since_last_access_time_greater_than    = -1
                  + tier_to_cold_after_days_since_modification_greater_than        = -1
                  + tier_to_cool_after_days_since_creation_greater_than            = -1
                  + tier_to_cool_after_days_since_last_access_time_greater_than    = -1
                  + tier_to_cool_after_days_since_modification_greater_than        = -1
                }
            }

          + filters {
              + blob_types   = [
                  + "blockBlob",
                ]
              + prefix_match = [
                  + "am-law-archive/",
                ]
            }
        }
    }

  # azurerm_subnet.bastion["primary"] will be created
  + resource "azurerm_subnet" "bastion" {
      + address_prefixes                              = [
          + "10.0.1.0/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "AzureBastionSubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-hub-japaneast"
      + virtual_network_name                          = "vnet-hub-japaneast"
    }

  # azurerm_subnet.bastion["secondary"] will be created
  + resource "azurerm_subnet" "bastion" {
      + address_prefixes                              = [
          + "10.1.1.0/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "AzureBastionSubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-hub-japanwest"
      + virtual_network_name                          = "vnet-hub-japanwest"
    }

  # azurerm_subnet.dns_resolver_inbound["primary"] will be created
  + resource "azurerm_subnet" "dns_resolver_inbound" {
      + address_prefixes                              = [
          + "10.0.3.0/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "InboundEndpointSubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-hub-japaneast"
      + virtual_network_name                          = "vnet-hub-japaneast"

      + delegation {
          + name = "Microsoft.Network.dnsResolvers"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.Network/dnsResolvers"
            }
        }
    }

  # azurerm_subnet.dns_resolver_inbound["secondary"] will be created
  + resource "azurerm_subnet" "dns_resolver_inbound" {
      + address_prefixes                              = [
          + "10.1.3.0/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "InboundEndpointSubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-hub-japanwest"
      + virtual_network_name                          = "vnet-hub-japanwest"

      + delegation {
          + name = "Microsoft.Network.dnsResolvers"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.Network/dnsResolvers"
            }
        }
    }

  # azurerm_subnet.dns_resolver_outbound["primary"] will be created
  + resource "azurerm_subnet" "dns_resolver_outbound" {
      + address_prefixes                              = [
          + "10.0.4.0/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "OutboundEndpointSubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-hub-japaneast"
      + virtual_network_name                          = "vnet-hub-japaneast"

      + delegation {
          + name = "Microsoft.Network.dnsResolvers"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.Network/dnsResolvers"
            }
        }
    }

  # azurerm_subnet.dns_resolver_outbound["secondary"] will be created
  + resource "azurerm_subnet" "dns_resolver_outbound" {
      + address_prefixes                              = [
          + "10.1.4.0/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "OutboundEndpointSubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-hub-japanwest"
      + virtual_network_name                          = "vnet-hub-japanwest"

      + delegation {
          + name = "Microsoft.Network.dnsResolvers"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.Network/dnsResolvers"
            }
        }
    }

  # azurerm_subnet.firewall["primary"] will be created
  + resource "azurerm_subnet" "firewall" {
      + address_prefixes                              = [
          + "10.0.2.0/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "AzureFirewallSubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-hub-japaneast"
      + virtual_network_name                          = "vnet-hub-japaneast"
    }

  # azurerm_subnet.firewall["secondary"] will be created
  + resource "azurerm_subnet" "firewall" {
      + address_prefixes                              = [
          + "10.1.2.0/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "AzureFirewallSubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-hub-japanwest"
      + virtual_network_name                          = "vnet-hub-japanwest"
    }

  # azurerm_subnet.gateway["primary"] will be created
  + resource "azurerm_subnet" "gateway" {
      + address_prefixes                              = [
          + "10.0.0.0/27",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "GatewaySubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-hub-japaneast"
      + virtual_network_name                          = "vnet-hub-japaneast"
    }

  # azurerm_subnet.gateway["secondary"] will be created
  + resource "azurerm_subnet" "gateway" {
      + address_prefixes                              = [
          + "10.1.0.0/27",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "GatewaySubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-hub-japanwest"
      + virtual_network_name                          = "vnet-hub-japanwest"
    }

  # azurerm_subnet_route_table_association.gateway["primary"] will be created
  + resource "azurerm_subnet_route_table_association" "gateway" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # azurerm_subnet_route_table_association.gateway["secondary"] will be created
  + resource "azurerm_subnet_route_table_association" "gateway" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # azurerm_user_assigned_identity.ama will be created
  + resource "azurerm_user_assigned_identity" "ama" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "japaneast"
      + name                = "uami-ama-japaneast"
      + principal_id        = (known after apply)
      + resource_group_name = "rg-management-japaneast"
      + tags                = {
          + "deployed_by" = "terraform"
          + "environment" = "production"
          + "managed_by"  = "platform-team"
        }
      + tenant_id           = (known after apply)
    }

  # azurerm_user_assigned_identity.amba will be created
  + resource "azurerm_user_assigned_identity" "amba" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "japaneast"
      + name                = "uami-amba-japaneast"
      + principal_id        = (known after apply)
      + resource_group_name = "rg-amba-alerts-japaneast"
      + tags                = {
          + "deployed_by" = "terraform"
          + "environment" = "production"
          + "managed_by"  = "platform-team"
        }
      + tenant_id           = (known after apply)
    }

  # azurerm_virtual_network.hub["primary"] will be created
  + resource "azurerm_virtual_network" "hub" {
      + address_space                  = [
          + "10.0.0.0/16",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "japaneast"
      + name                           = "vnet-hub-japaneast"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "rg-hub-japaneast"
      + subnet                         = (known after apply)
      + tags                           = {
          + "deployed_by" = "terraform"
          + "environment" = "production"
          + "managed_by"  = "platform-team"
        }
    }

  # azurerm_virtual_network.hub["secondary"] will be created
  + resource "azurerm_virtual_network" "hub" {
      + address_space                  = [
          + "10.1.0.0/16",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "japanwest"
      + name                           = "vnet-hub-japanwest"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "rg-hub-japanwest"
      + subnet                         = (known after apply)
      + tags                           = {
          + "deployed_by" = "terraform"
          + "environment" = "production"
          + "managed_by"  = "platform-team"
        }
    }

  # azurerm_virtual_network_gateway.er["primary"] will be created
  + resource "azurerm_virtual_network_gateway" "er" {
      + active_active                         = (known after apply)
      + bgp_enabled                           = (known after apply)
      + bgp_route_translation_for_nat_enabled = false
      + enable_bgp                            = (known after apply)
      + generation                            = (known after apply)
      + id                                    = (known after apply)
      + ip_sec_replay_protection_enabled      = true
      + location                              = "japaneast"
      + name                                  = "ergw-hub-japaneast"
      + remote_vnet_traffic_enabled           = false
      + resource_group_name                   = "rg-hub-japaneast"
      + sku                                   = "Standard"
      + tags                                  = {
          + "deployed_by" = "terraform"
          + "environment" = "production"
          + "managed_by"  = "platform-team"
        }
      + type                                  = "ExpressRoute"
      + virtual_wan_traffic_enabled           = false
      + vpn_type                              = "RouteBased"

      + bgp_settings (known after apply)

      + ip_configuration {
          + name                          = "ergw-ipconfig"
          + private_ip_address_allocation = "Dynamic"
          + subnet_id                     = (known after apply)
        }
    }

  # azurerm_virtual_network_gateway.er["secondary"] will be created
  + resource "azurerm_virtual_network_gateway" "er" {
      + active_active                         = (known after apply)
      + bgp_enabled                           = (known after apply)
      + bgp_route_translation_for_nat_enabled = false
      + enable_bgp                            = (known after apply)
      + generation                            = (known after apply)
      + id                                    = (known after apply)
      + ip_sec_replay_protection_enabled      = true
      + location                              = "japanwest"
      + name                                  = "ergw-hub-japanwest"
      + remote_vnet_traffic_enabled           = false
      + resource_group_name                   = "rg-hub-japanwest"
      + sku                                   = "Standard"
      + tags                                  = {
          + "deployed_by" = "terraform"
          + "environment" = "production"
          + "managed_by"  = "platform-team"
        }
      + type                                  = "ExpressRoute"
      + virtual_wan_traffic_enabled           = false
      + vpn_type                              = "RouteBased"

      + bgp_settings (known after apply)

      + ip_configuration {
          + name                          = "ergw-ipconfig"
          + private_ip_address_allocation = "Dynamic"
          + subnet_id                     = (known after apply)
        }
    }

  # azurerm_virtual_network_peering.hub_forward["primary-to-secondary"] will be created
  + resource "azurerm_virtual_network_peering" "hub_forward" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "peer-primary-to-secondary"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = (known after apply)
      + resource_group_name                    = "rg-hub-japaneast"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "vnet-hub-japaneast"
    }

  # azurerm_virtual_network_peering.hub_reverse["primary-to-secondary"] will be created
  + resource "azurerm_virtual_network_peering" "hub_reverse" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "peer-secondary-to-primary"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = (known after apply)
      + resource_group_name                    = "rg-hub-japanwest"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "vnet-hub-japanwest"
    }

  # time_sleep.wait_for_mg_rbac will be created
  + resource "time_sleep" "wait_for_mg_rbac" {
      + create_duration = "240s"
      + id              = (known after apply)
    }

  # time_sleep.wait_for_root_mg will be created
  + resource "time_sleep" "wait_for_root_mg" {
      + create_duration = "30s"
      + id              = (known after apply)
    }

Plan: 1042 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ama_identity_id                = (known after apply)
  + ama_identity_principal_id      = (known after apply)
  + dcr_vm_insights_id             = (known after apply)
  + er_circuit_ids                 = {
      + primary   = (known after apply)
      + secondary = (known after apply)
    }
  + er_gateway_ids                 = {
      + primary   = (known after apply)
      + secondary = (known after apply)
    }
  + firewall_private_ips           = {
      + primary   = (known after apply)
      + secondary = (known after apply)
    }
  + firewall_public_ips            = {
      + primary   = (known after apply)
      + secondary = (known after apply)
    }
  + gateway_route_table_ids        = {
      + primary   = (known after apply)
      + secondary = (known after apply)
    }
  + hub_virtual_network_ids        = {
      + primary   = (known after apply)
      + secondary = (known after apply)
    }
  + hub_virtual_network_names      = {
      + primary   = "vnet-hub-japaneast"
      + secondary = "vnet-hub-japanwest"
    }
  + law_archive_storage_account_id = (known after apply)
  + log_analytics_workspace_id     = (known after apply)
  + log_analytics_workspace_name   = "law-management-japaneast"
  + management_group_ids           = {
      + connectivity   = (known after apply)
      + corp           = (known after apply)
      + decommissioned = (known after apply)
      + identity       = (known after apply)
      + landing_zones  = (known after apply)
      + management     = (known after apply)
      + online         = (known after apply)
      + platform       = (known after apply)
      + root           = (known after apply)
      + sandbox        = (known after apply)
      + security       = (known after apply)
    }
  + route_table_ids                = {
      + primary   = (known after apply)
      + secondary = (known after apply)
    }
  + vending_virtual_network_ids    = {
      + test-subscription = (known after apply)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```
*Triggered by @shuhei0720*